In [4]:
import numpy as np
import pandas as pd

s = pd.Series([1,3,5,np.nan,6,8], name='first')
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
Name: first, dtype: float64

In [5]:
s.name

'first'

In [6]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [7]:
s.values

array([ 1.,  3.,  5., nan,  6.,  8.])

In [8]:
s.shape

(6,)

In [9]:
s.size

6

In [10]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
Name: first, dtype: float64

In [11]:
s[1]

np.float64(3.0)

In [12]:
s[1:5]

1    3.0
2    5.0
3    NaN
4    6.0
Name: first, dtype: float64

In [13]:
s.index = list('abcdef')
s

a    1.0
b    3.0
c    5.0
d    NaN
e    6.0
f    8.0
Name: first, dtype: float64

In [14]:
print(s['b'],s['d'])

3.0 nan

In [15]:
s['c':'e']

c    5.0
d    NaN
e    6.0
Name: first, dtype: float64

In [16]:
s['b':'f']

b    3.0
c    5.0
d    NaN
e    6.0
f    8.0
Name: first, dtype: float64

In [17]:
s[0:3]

a    1.0
b    3.0
c    5.0
Name: first, dtype: float64

In [18]:
s1 = s[1:4]
s1

b    3.0
c    5.0
d    NaN
Name: first, dtype: float64

In [19]:
s1[0]

C:\Users\User\AppData\Local\Temp\ipykernel_428\643609873.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s1[0]

np.float64(3.0)

In [20]:
s1[0] =10
s1

C:\Users\User\AppData\Local\Temp\ipykernel_428\206345822.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  s1[0] =10

b    10.0
c     5.0
d     NaN
Name: first, dtype: float64

In [21]:
s

a     1.0
b    10.0
c     5.0
d     NaN
e     6.0
f     8.0
Name: first, dtype: float64

In [23]:
s.index = np.arange(1,7)
s

1     1.0
2    10.0
3     5.0
4     NaN
5     6.0
6     8.0
Name: first, dtype: float64

In [24]:
s[1]

np.float64(1.0)

In [25]:
s[0]

KeyError: 0

In [26]:
import pandas as pd

age = pd.Series([9,17,32,45,65,98], index=list('abcdef'), name='age')
age

a     9
b    17
c    32
d    45
e    65
f    98
Name: age, dtype: int64

In [27]:
age['b']

np.int64(17)

In [28]:
age[[1,3,5]]

C:\Users\User\AppData\Local\Temp\ipykernel_428\2675513065.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  age[[1,3,5]]

b    17
d    45
f    98
Name: age, dtype: int64

In [29]:
age[['a','f','d']]

a     9
f    98
d    45
Name: age, dtype: int64

In [30]:
age[['c']]

c    32
Name: age, dtype: int64

In [31]:
import pandas as pd

s = pd.Series([3,6,-3,0,-4,8,-7])
s

0    3
1    6
2   -3
3    0
4   -4
5    8
6   -7
dtype: int64

In [32]:
s >0

0     True
1     True
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [33]:
s%2 ==0

0    False
1     True
2    False
3     True
4     True
5     True
6    False
dtype: bool

In [34]:
s[s>0]

0    3
1    6
5    8
dtype: int64

In [35]:
s[~(s>0)]

2   -3
3    0
4   -4
6   -7
dtype: int64

In [36]:
s[s%2 == 0]

1    6
3    0
4   -4
5    8
dtype: int64

In [37]:
s[s%2 !=0]

0    3
2   -3
6   -7
dtype: int64

In [38]:
s[(s>0)&(s%2 ==0)]

1    6
5    8
dtype: int64

In [39]:
import numpy as np
import pandas as pd

s = ['희빈','수영','현수','지호','지민']
p = pd.Series([99,84,92,65,78], index=s)
p

희빈    99
수영    84
현수    92
지호    65
지민    78
dtype: int64

In [40]:
p.name = '수학성적'
p.index.name = 'st_name'
p

st_name
희빈    99
수영    84
현수    92
지호    65
지민    78
Name: 수학성적, dtype: int64

In [41]:
p.sort_values()

st_name
지호    65
지민    78
수영    84
현수    92
희빈    99
Name: 수학성적, dtype: int64

In [42]:
p.sort_values(ascending=False)

st_name
희빈    99
현수    92
수영    84
지민    78
지호    65
Name: 수학성적, dtype: int64

In [43]:
p.sort_index()

st_name
수영    84
지민    78
지호    65
현수    92
희빈    99
Name: 수학성적, dtype: int64

In [44]:
p.sort_index(ascending=False)

st_name
희빈    99
현수    92
지호    65
지민    78
수영    84
Name: 수학성적, dtype: int64

In [45]:
import numpy as np
import pandas as pd

s = ['희빈','수영','현수','지호','지민']
p = pd.Series([99,84,92,65,78], index=s)
p

희빈    99
수영    84
현수    92
지호    65
지민    78
dtype: int64

In [47]:
print(p.max())
print(p.min())

99
65

In [48]:
print(p.mean())
print(p.median())

83.6
84.0

In [49]:
print(p.count())
print(p.size)

5
5

In [50]:
p.describe()

count     5.000000
mean     83.600000
std      13.088163
min      65.000000
25%      78.000000
50%      84.000000
75%      92.000000
max      99.000000
dtype: float64

In [51]:
import numpy as np
import pandas as pd

s = pd.Series([3,1,1,2,None,np.nan,4,6,6])
s

0    3.0
1    1.0
2    1.0
3    2.0
4    NaN
5    NaN
6    4.0
7    6.0
8    6.0
dtype: float64

In [52]:
s.values

array([ 3.,  1.,  1.,  2., nan, nan,  4.,  6.,  6.])

In [53]:
s.count()

np.int64(7)

In [55]:
s.value_counts()

1.0    2
6.0    2
3.0    1
2.0    1
4.0    1
Name: count, dtype: int64

In [56]:
s.value_counts(dropna=False)

1.0    2
NaN    2
6.0    2
3.0    1
2.0    1
4.0    1
Name: count, dtype: int64

In [57]:
import numpy as np
import pandas as pd

s = pd.Series([3,1,1,2,None,np.nan,4,6,6])
s

0    3.0
1    1.0
2    1.0
3    2.0
4    NaN
5    NaN
6    4.0
7    6.0
8    6.0
dtype: float64

In [58]:
s.value_counts(sort=False,dropna=False)

3.0    1
1.0    2
2.0    1
NaN    2
4.0    1
6.0    2
Name: count, dtype: int64

In [59]:
s.value_counts(bins=4)

(0.994, 2.25]    3
(4.75, 6.0]      2
(2.25, 3.5]      1
(3.5, 4.75]      1
Name: count, dtype: int64

In [60]:
s.value_counts(bins=4, sort=False)

(0.994, 2.25]    3
(2.25, 3.5]      1
(3.5, 4.75]      1
(4.75, 6.0]      2
Name: count, dtype: int64

In [61]:
s.value_counts(bins=[0.5,3.5,6.5], sort=False)

(0.499, 3.5]    4
(3.5, 6.5]      3
Name: count, dtype: int64

In [62]:
import pandas as pd

df = pd.DataFrame([10,20,30,40,50])
df

    0
0  10
1  20
2  30
3  40
4  50

In [63]:
import pandas as pd

df=pd.DataFrame([[1,2,3],[10,20,30],[100,200,300]],index=list('abc'))
df

     0    1    2
a    1    2    3
b   10   20   30
c  100  200  300

In [64]:
import pandas as pd

df=pd.DataFrame([[1,2,3],[10,20,30],[100,200,300]],index=list('abc'),columns=['A','B','C'])
df

     A    B    C
a    1    2    3
b   10   20   30
c  100  200  300

In [65]:
print(df.index)
print(df.columns)

Index(['a', 'b', 'c'], dtype='object')
Index(['A', 'B', 'C'], dtype='object')

In [66]:
import numpy as np
import pandas as pd

df1 = pd.DataFrame(data = np.arange(12).reshape(3,4))
df1

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [67]:
import numpy as np
import pandas as pd

df1 = pd.DataFrame(np.random.randint(1,46,(5,6)))
df1

    0   1   2   3   4   5
0  27  18  14  41  41  38
1  15   1  21  42  23  44
2  25   4  34  27  30   3
3  24  43  12  35   8   9
4  22  45  30  43  37  29

In [68]:
df1 = pd.DataFrame(np.random.random((5,3)))
df1

          0         1         2
0  0.658320  0.479497  0.648844
1  0.399410  0.400326  0.428824
2  0.752780  0.144791  0.659288
3  0.976302  0.393064  0.135420
4  0.296208  0.367738  0.880038

In [69]:
df = pd.DataFrame({'국어': [82,76,67], '수학':[99,87,78]},index=['김국진','신영희','이길순'])
df

     국어  수학
김국진  82  99
신영희  76  87
이길순  67  78

In [70]:
df.index

Index(['김국진', '신영희', '이길순'], dtype='object')

In [71]:
df.columns

Index(['국어', '수학'], dtype='object')

In [72]:
import pandas as pd

df = pd.DataFrame({'numbers':[1,2,3],'colors':['red','white','blue']})
df

   numbers colors
0        1    red
1        2  white
2        3   blue

In [73]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [74]:
df.columns

Index(['numbers', 'colors'], dtype='object')

In [75]:
courses = pd.Series(["Spark","PySpark","Hadoop"],name='courses')
courses

0      Spark
1    PySpark
2     Hadoop
Name: courses, dtype: object

In [76]:
fees = pd.Series([250000,300000,200000],name='fees')
fees

0    250000
1    300000
2    200000
Name: fees, dtype: int64

In [77]:
df = pd.DataFrame({courses.name: courses, fees.name:fees})
df

   courses    fees
0    Spark  250000
1  PySpark  300000
2   Hadoop  200000

In [78]:
courses = pd.Series(["Spark","PySpark","Hadoop"],name='courses')
fees = pd.Series([250000,300000,200000],name='fees')

df = pd.concat([courses,fees], axis=1)
df

   courses    fees
0    Spark  250000
1  PySpark  300000
2   Hadoop  200000

In [79]:
courses = pd.Series(["Spark","PySpark","Hadoop"],name='courses')
fees = pd.Series([250000,300000,200000],name='fees')

df = pd.concat([courses,fees])
df

0      Spark
1    PySpark
2     Hadoop
0     250000
1     300000
2     200000
dtype: object

In [80]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [81]:
courses = pd.Series(["Spark","PySpark","Hadoop"],name='courses')
df[courses.name] = courses
df

   courses
0    Spark
1  PySpark
2   Hadoop

In [82]:
fees = pd.Series([250000,300000,200000],name='fees')
df[fees.name] = fees
df

   courses    fees
0    Spark  250000
1  PySpark  300000
2   Hadoop  200000

In [83]:
import pandas as pd

df = pd.DataFrame([{'국어':70,'수학':89,'영어':90},
                   {'국어':80,'영어':99},
                   {'수학':66,'영어':78}])
df

     국어    수학  영어
0  70.0  89.0  90
1  80.0   NaN  99
2   NaN  66.0  78

In [84]:
import pandas as pd

s1 = pd.Series([90,80,60,66])
s2 = pd.Series([45,73,83,99])
s3 = pd.Series([92,75,82,75])
s1

0    90
1    80
2    60
3    66
dtype: int64

In [85]:
df = pd.DataFrame({'국어': s1, '영어': s2, '수학': s3})
df

   국어  영어  수학
0  90  45  92
1  80  73  75
2  60  83  82
3  66  99  75

In [86]:
df.index = ['노','장','박','강']
df

   국어  영어  수학
노  90  45  92
장  80  73  75
박  60  83  82
강  66  99  75

In [88]:
dates = pd.date_range("20250101", periods=6)
dates

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06'],
              dtype='datetime64[ns]', freq='D')

In [89]:
dates[0]

Timestamp('2025-01-01 00:00:00')

In [90]:
dates = pd.date_range("20250101", end='20250110')
dates

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06', '2025-01-07', '2025-01-08',
               '2025-01-09', '2025-01-10'],
              dtype='datetime64[ns]', freq='D')

In [91]:
dates = pd.date_range("20240101",periods=6,freq='3D')
dates

DatetimeIndex(['2024-01-01', '2024-01-04', '2024-01-07', '2024-01-10',
               '2024-01-13', '2024-01-16'],
              dtype='datetime64[ns]', freq='3D')

In [92]:
dates = pd.date_range("20240101",periods=6,freq='3H')
dates

C:\Users\User\AppData\Local\Temp\ipykernel_428\2069440322.py:1: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  dates = pd.date_range("20240101",periods=6,freq='3H')

DatetimeIndex(['2024-01-01 00:00:00', '2024-01-01 03:00:00',
               '2024-01-01 06:00:00', '2024-01-01 09:00:00',
               '2024-01-01 12:00:00', '2024-01-01 15:00:00'],
              dtype='datetime64[ns]', freq='3h')

In [93]:
dates = pd.date_range("20240101",periods=6,freq='W')
dates

DatetimeIndex(['2024-01-07', '2024-01-14', '2024-01-21', '2024-01-28',
               '2024-02-04', '2024-02-11'],
              dtype='datetime64[ns]', freq='W-SUN')

In [94]:
dates = pd.date_range("20240101",periods=6,freq='W-SUN')
dates

DatetimeIndex(['2024-01-07', '2024-01-14', '2024-01-21', '2024-01-28',
               '2024-02-04', '2024-02-11'],
              dtype='datetime64[ns]', freq='W-SUN')

In [95]:
dates = pd.date_range("20240101",periods=6,freq='W-TUE')
dates

DatetimeIndex(['2024-01-02', '2024-01-09', '2024-01-16', '2024-01-23',
               '2024-01-30', '2024-02-06'],
              dtype='datetime64[ns]', freq='W-TUE')

In [96]:
dates = pd.date_range("20240101",periods=6,freq='W-FRI')
dates

DatetimeIndex(['2024-01-05', '2024-01-12', '2024-01-19', '2024-01-26',
               '2024-02-02', '2024-02-09'],
              dtype='datetime64[ns]', freq='W-FRI')

In [97]:
dates = pd.date_range("20240101",periods=6,freq='M')
dates

C:\Users\User\AppData\Local\Temp\ipykernel_428\2163828750.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dates = pd.date_range("20240101",periods=6,freq='M')

DatetimeIndex(['2024-01-31', '2024-02-29', '2024-03-31', '2024-04-30',
               '2024-05-31', '2024-06-30'],
              dtype='datetime64[ns]', freq='ME')

In [98]:
dates = pd.date_range("20240101",periods=6,freq='MS')
dates

DatetimeIndex(['2024-01-01', '2024-02-01', '2024-03-01', '2024-04-01',
               '2024-05-01', '2024-06-01'],
              dtype='datetime64[ns]', freq='MS')

In [99]:
dates =pd.date_range("20250302",periods=6)
dates

DatetimeIndex(['2025-03-02', '2025-03-03', '2025-03-04', '2025-03-05',
               '2025-03-06', '2025-03-07'],
              dtype='datetime64[ns]', freq='D')

In [101]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2025-03-02 -0.846590 -0.155899  2.428590  1.527725
2025-03-03 -1.187278 -1.362404  0.546590  1.332276
2025-03-04  0.739606  0.369590  2.164568  0.199140
2025-03-05 -0.034997  1.465840  0.339521  1.164429
2025-03-06 -1.483498  1.107457  0.734458 -0.786983
2025-03-07 -0.110511 -0.838729  1.445356  0.767298

In [103]:
df2 = pd.DataFrame({
    "A":1.0,
    "B": pd.Timestamp("20260302"),
    "C": pd.Series(np.arange(1,3, .5)),
    "D": np.array([3] *4, dtype="int32"),
    "E": pd.Categorical(["test","train","test","train"]),
    "F":"foo"
})

df2

     A          B    C  D      E    F
0  1.0 2026-03-02  1.0  3   test  foo
1  1.0 2026-03-02  1.5  3  train  foo
2  1.0 2026-03-02  2.0  3   test  foo
3  1.0 2026-03-02  2.5  3  train  foo

In [ ]:
import pandas as pd

pf = pd.DataFrame(data = [[25,35,8,18],
                          [18,27,10,20],
                          [12,22,9,20],
                          [22,34,8,16]],
                 index=['윤일형','강수희','홍소희','유한빈','신수빈'],
                 columns=['중간','기말','과제','출석'])
pf

In [108]:
pip install lxml

Collecting lxml
  Downloading lxml-5.3.0-cp312-cp312-win_amd64.whl.metadata (3.9 kB)
Downloading lxml-5.3.0-cp312-cp312-win_amd64.whl (3.8 MB)
   ---------------------------------------- 0.0/3.8 MB ? eta -:--:--
    --------------------------------------- 0.1/3.8 MB 1.6 MB/s eta 0:00:03
   - -------------------------------------- 0.1/3.8 MB 1.7 MB/s eta 0:00:03
   - -------------------------------------- 0.2/3.8 MB 1.6 MB/s eta 0:00:03
   -- ------------------------------------- 0.3/3.8 MB 1.4 MB/s eta 0:00:03
   --- ------------------------------------ 0.3/3.8 MB 1.4 MB/s eta 0:00:03
   ---- ----------------------------------- 0.4/3.8 MB 1.7 MB/s eta 0:00:02
   ----- ---------------------------------- 0.5/3.8 MB 1.7 MB/s eta 0:00:02
   ------ --------------------------------- 0.6/3.8 MB 1.8 MB/s eta 0:00:02
   ------- -------------------------------- 0.7/3.8 MB 1.8 MB/s eta 0:00:02
   -------- ------------------------------- 0.8/3.8 MB 1.9 MB/s eta 0:00:02
   ---------- ----------------------------- 1.0/3.8 MB 2.0 MB/s eta 0:00:02
   ----------- ---------------------------- 1.1/3.8 MB 2.0 MB/s eta 0:00:02
   ------------ --------------------------- 1.2/3.8 MB 2.0 MB/s eta 0:00:02
   ------------ --------------------------- 1.2/3.8 MB 1.9 MB/s eta 0:00:02
   -------------- ------------------------- 1.4/3.8 MB 1.9 MB/s eta 0:00:02
   --------------- ------------------------ 1.5/3.8 MB 2.0 MB/s eta 0:00:02
   ---------------- ----------------------- 1.6/3.8 MB 2.1 MB/s eta 0:00:02
   ----------------- ---------------------- 1.7/3.8 MB 2.0 MB/s eta 0:00:02
   ------------------ --------------------- 1.8/3.8 MB 2.0 MB/s eta 0:00:02
   ------------------- -------------------- 1.8/3.8 MB 1.9 MB/s eta 0:00:02
   -------------------- ------------------- 2.0/3.8 MB 2.0 MB/s eta 0:00:01
   ----------------------- ---------------- 2.2/3.8 MB 2.0 MB/s eta 0:00:01
   ------------------------ --------------- 2.3/3.8 MB 2.0 MB/s eta 0:00:01
   ------------------------- -------------- 2.4/3.8 MB 2.0 MB/s eta 0:00:01
   -------------------------- ------------- 2.5/3.8 MB 2.0 MB/s eta 0:00:01
   --------------------------- ------------ 2.6/3.8 MB 2.0 MB/s eta 0:00:01
   ---------------------------- ----------- 2.8/3.8 MB 2.0 MB/s eta 0:00:01
   ----------------------------- ---------- 2.8/3.8 MB 2.0 MB/s eta 0:00:01
   ------------------------------ --------- 2.9/3.8 MB 2.0 MB/s eta 0:00:01
   ------------------------------- -------- 3.0/3.8 MB 2.0 MB/s eta 0:00:01
   ------------------------------- -------- 3.0/3.8 MB 2.0 MB/s eta 0:00:01
   -------------------------------- ------- 3.1/3.8 MB 1.9 MB/s eta 0:00:01
   -------------------------------- ------- 3.1/3.8 MB 1.9 MB/s eta 0:00:01
   ----------------------------------- ---- 3.4/3.8 MB 1.9 MB/s eta 0:00:01
   ------------------------------------- -- 3.6/3.8 MB 1.9 MB/s eta 0:00:01
   -------------------------------------- - 3.6/3.8 MB 1.9 MB/s eta 0:00:01
   ---------------------------------------  3.7/3.8 MB 1.9 MB/s eta 0:00:01
   ---------------------------------------- 3.8/3.8 MB 1.9 MB/s eta 0:00:00
Installing collected packages: lxml
Successfully installed lxml-5.3.0
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [109]:
import pandas as pd

df = pd.read_html('https://ko.wikipedia.org/wiki/2024%EB%85%84_%ED%95%98%EA%B3%84_%EC%98%AC%EB%A6%BC%ED%94%BD_%EB%A9%94%EB%8B%AC_%EC%A7%91%EA%B3%84')
print(df)

[Empty DataFrame
Columns: [2024년 하계 올림픽 메달 집계, 2024년 하계 올림픽 메달 집계.1]
Index: [],                                                    0
0  준비 (개최 도시 선정, 개최 장소, 성화 봉송) 홍보 (프리주) 방송 개막식 (기...
1                                IOC · CNOSF · POCOG,           순위             나라    금    은    동    합계
0          1       미국 (USA)   40   44   42   126
1          2       중국 (CHN)   40   27   24    91
2          3       일본 (JPN)   20   12   13    45
3          4  오스트레일리아 (AUS)   18   19   16    53
4          5     프랑스 (FRA)*   16   26   22    64
..       ...            ...  ...  ...  ...   ...
88        84    카보베르데 (CPV)    0    0    1     1
89        84      카타르 (QAT)    0    0    1     1
90        84   코트디부아르 (CIV)    0    0    1     1
91        84       페루 (PER)    0    0    1     1
92  합계 (91개)       합계 (91개)  329  330  385  1044

[93 rows x 6 columns],   vte올림픽 메달 집계                                     vte올림픽 메달 집계.1
0       하계 올림픽  1896 1900 1904 1908 1912 1920 1924 1928 1932 1...
1       동계 올림픽  1924 1928 1932 1936 1948 1952 1956 1960 1964 1...
2   하계 청소년 올림픽                                     2010 2014 2018
3   동계 청소년 올림픽                                     2012 2016 2020,                                vte2024년 하계 올림픽 경기 종목  \
0  골프 근대5종 농구 다이빙 럭비 레슬링 배구 배드민턴 복싱 브레이킹 사격 사이클 서...
1                                  진행 상황 메달 집계 메달리스트

                             vte2024년 하계 올림픽 경기 종목.1
0  골프 근대5종 농구 다이빙 럭비 레슬링 배구 배드민턴 복싱 브레이킹 사격 사이클 서...
1                                  진행 상황 메달 집계 메달리스트  ]

In [110]:
print(type(df))
print(type(df[0]))

<class 'list'>
<class 'pandas.core.frame.DataFrame'>

In [111]:
import pandas as pd

df = pd.read_html('https://ko.wikipedia.org/wiki/2024%EB%85%84_%ED%95%98%EA%B3%84_%EC%98%AC%EB%A6%BC%ED%94%BD_%EB%A9%94%EB%8B%AC_%EC%A7%91%EA%B3%84')
df[0]

Empty DataFrame
Columns: [2024년 하계 올림픽 메달 집계, 2024년 하계 올림픽 메달 집계.1]
Index: []